import React from "react";

import CryptoDictionaryHead from "./crypto-dictionary-head";
import { StyledDictionaryItem } from "../styled-crypto-dictionary";

const CryptoDictionaryItemH = () => {
  return (
    <div id="H">
      <CryptoDictionaryHead current="H" />
      <StyledDictionaryItem id="Halving">
        <h2>Halving</h2>{" "}
        (Халвинг) – данный термин с английского переводится, как «уполовинивание» или подразумевает
        «деление на два». Это уменьшение вознаграждения для майнеров за каждый добытый ими новый блок в
        сети блокчейн. С
        наступлением халвинга, уменьшение вознаграждения за каждый добытый блок сокращается в два раза.
        Разработчики
        Bitcoin программно заложил халвинги в сети биткоина через каждые 210 тысяч блоков, то есть раз
        в 4 года — вплоть
        до того момента, когда с добычей 21 млн монет (предположительно в 2140 году) эмиссия
        криптовалюты будет
        закончена. Если в начале истории биткоина за добавление в блокчейн нового блока, майнеры могли
        заработать 50
        BTC, то после первого халвинга размер их вознаграждения сократился до 25 BTC, а после второго –
        до 12,5 BTC. С
        2009 года, с даты запуска первой криптовалюты, в сети биткоина, халвинг проводился 28 ноября
        2012 года и 9 июля
        2016 года. Следующий халвинг на блоке 630000 можно ожидать в мае 2020 года. Он уменьшит
        вознаграждение майнерам
        до 6,25 монет. Многие считают, что в результате халвинга, майниг Bitcoin со временем станет
        менее прибыльным, а
        в будущем и вовсе будет неприбыльным, и будет остановлен. Но, это не совсем так. После снижения
        вознаграждения
        за добытый блок, цена за одну монету Bitcoin должна увеличиваться. Кроме того, ограниченное
        предложение биткоина
        будет создавать дополнительный стимул для роста его цены. Это и есть основная причина халвинга
        – удержание
        инфляции под контролем с помощью искусственной дефляционной модели. Если монеты создаются
        слишком быстро или их
        выпуск не ограничивается, в обращении появится слишком много монет и их стоимость начнет
        постепенно снижаться.
        Именно это можно наблюдать в мире фиатных валют. Если банк увеличивает эмиссию валюты при
        сохранении стабильного
        спроса на нее, то стоимость валюты падает и наоборот.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Hamster">
        <h2>Hamster</h2>{" "}
        (Хомяк) – это доверчивые новые игроки на рынке. Они очень доверчивые и
        неопытные. Они не имеют опыта и знаний для принятия собственных и грамотных решений, и очень
        податливы чужому мнению, а также доверчиво относятся к практически любой точке зрения или
        прогнозу. Хомяки часто повторяют одни и те же ошибки и зачастую податливы эмоциям. В мире
        криптовалют существует высказывание «стричь хомячков», это понятие трактуется, как нажива на
        доверчивых игроках. Хомяки часто страдают из-за собственной доверчивости, поскольку им часто
        сливают неправдивую информацию, или вовлекают в схемы «Pamp» и «Damp». В то время, как
        стоимость криптовалюты была низкой, некоторые недобросовестные трейдеры начинают скупать
        активно данный вид криптовалюты, распространяя слух, что данная валюта скоро стремительно
        начнёт расти и на самом её пике, будет выгодно её продать. И в момент ажиотажа действительно
        спрос на эту криптовалюту начинает расти, хоть и незначительно. При этом, для
        распространения слухов иногда задействуются целые площадки, форумы, печатные материалы,
        статьи, новости и СМИ если есть такая возможность. Чаще всего, такого рода мошенничеством
        занимаются узкие группы недобросовестных трейдеров. Хомяки начинают поддаваться влиянию и
        «набивать за щёки» множество монет, по уже растущей цене. Как правило, покупать они начинают
        не сразу, а в момент, когда цена существенно вырастет и продолжит расти. Опасаясь, что не
        успеют купить столь перспективный актив, хомяки начинают закупаться уже практически на пике
        максимально возможного роста данной криптовалюты в определённых условиях рынка.
        Недобросовестные трейдеры в этом момент начинают активно продавать криптовалюту по
        завышенной цене, которую так активно скупают хомяки. На существенной разнице курсов,
        азартные трейдеры и имеют прибыль. Спустя некоторое время, курс криптовалюты, которую
        скупили хомяки, начнёт активно падать, но они подумают, что это временное явление и будут
        ожидать. Однако, при стабильном падении хомяки на эмоциях просто продадут скопленную крипту
        в порыве гнева по рыночной цене, при этом потеряв разницу. Дамперы в этот момент опять
        скупят всю валюту обратно по низкой цене. Спустя длительное время, уверенно и постепенно
        состояние рынка выровняется и курс вернётся на свой реальный уровень.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Hare">
        <h2>Hare</h2>{" "}
        (Заяц) – трейдеры, которые скупают много разных криптовалют и на мелких
        колебаниях рынка за небольшой промежуток времени, совершают сделку. Подобный вид заработка
        ещё называют «скальпингом». По аналогии с поведением зайца, трейдеры совершают быстро и
        много мелких скачков. Зайцы самые активные на рынке криптовалют. Они могут получать мелкую
        выгоду как на покупке, так и на продаже цифровых активов. Опять же таки по аналогии с
        зайцем, данный вид трейдеров всегда умудряются мелкими сделками надкусывая с каждой
        понемногу, наскоблить себе на морковку.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Hashrate">
        <h2>Hashrate</h2>{" "}
        (Хэшрейт) – единица измерения вычислительная мощность оборудования для добычи криптовалюты
        (майнинга). Во время майнинга вычислительная техника решает огромное количество математических
        задач, только
        после этого можно добыть криптовалюту. При этом все прошлые совершенные операции сохраняются в
        общем доступе.
        Добытчики биткоина подбирают нужный хэш из различных комбинаций, который дает доступ к
        секретным ключам и к
        новым операциям. Весь этот сложный математический процесс требует наличия мощного специального
        устройства,
        которое поможет в минимальные сроки подобрать нужный хэш. Проще говоря, хэшрейт можно
        определять, как скорость,
        с которой работает видеокарта (GPU) или <a href="#ASIC">ASIC</a>. Если сравнивать с
        автомобилем, то чем больше лошадиных сил в
        моторе, тем мощнее машина, так и в майнинге чем больше хэшрейт, тем больше монет.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Hodl">
        <h2>Hodl</h2>{" "}
        (Ходл) – термин означает долгосрочное инвестирование или удержание актива.
        Термин «Hodl» появился из-за опечатки одного трейдера. В декабре 2013 года, один из
        биткоин-вкладчиков, будучи на эмоциях вместо фразы «I am holding», написал на форуме «I am
        hodling». Трейдер имел в виду, что он будет держать (hold) монеты, несмотря ни на что.
        Криптосообщество «подхватило» опечатку, в социальных сетях было много шуток на эту тему. А
        позже термин получил развитие и стал сокращением от «Hold On for Dear Life» — держаться,
        словно это жизненно важно. Если человек говорит, что он «ходлит», это значит — он верит в
        свой токен и будет держать его, несмотря на скачки курса. Таким образом, понятие стало
        синонимом долгосрочного инвестирования в мире криптовалют.
      </StyledDictionaryItem>
    </div>
  );
};

export default CryptoDictionaryItemH;