import React from "react";

import CryptoDictionaryHead from "./crypto-dictionary-head";
import { StyledDictionaryItem } from "../styled-crypto-dictionary";

const CryptoDictionaryItemW = () => {
  return (
    <div id="W">
      <CryptoDictionaryHead current="W" />
      <StyledDictionaryItem id="Wallet">
        <h2>Wallet</h2>{" "}
        (Кошелек) – программное приложение, позволяющее производить транзакцию с заданного адреса и
        просматривать его баланс. Иными словами – это программная реализация физического кошелька, в
        котором хранятся денежные средства, выражены в цифровых активах. Криптовалютный кошелек – это инструмент,
        который вы можете
        использовать для взаимодействия с сетью блокчейн. Все кошельки в мире криптовалют делятся всего на два вида –
        холодные и горячие. Горячий кошелёк, это набор программных инструментов, размещённых в аккаунте определённого
        сервиса или биржи, средства с которого можно потратить в любое время. Этот кошелёк постоянно связан с
        интернетом, поскольку он поддерживает активное соединение с сетью Интернет, и работает он лишь при наличии
        постоянного интернет-соединения. Горячими считаются, как онлайн кошельки, так и кошельки криптовалютных бирж или
        платежных систем. Холодный кошелек для криптовалюты – это прежде всего пакет инструментов в USB носителе, с
        помощью которых можно хранить информацию, что нужна для доступа к криптовалюте, не требующихпостоянного
        интернет-соединения. «Холодный» кошелёк действует совершенно противоположным образом в отличии от «горячего». Он
        не предназначен для регулярного отправления криптовалюты, тем не менее, средства на него можно
        получить в любое время. Холодный кошелёк не имеет прямого соединения с интернетом, поскольку он используется для
        хранения криптовалюты в режиме оффлайн. Если у кошелька нет соединения с интернетом, злоумышленники не смогут
        украсть из него средства, это возможно только при непосредственном физическом доступе к носителю информации с
        кошельком. «Горячий» кошелёк, наоборот, остаётся уязвимым для атак злоумышленников, поэтому в нём рекомендуется
        хранить минимально необходимые суммы. Несмотря на то, что для получения средств можно пользоваться и тем, и
        другим кошельком, рекомендуется полагаться на горячий кошелёк. После подтверждения транзакции деньги из горячего
        кошелька можно сразу же переместить в холодный. Пользователи оставляют на горячем кошельке небольшое количество
        криптовалюты для текущих расходов. Всё остальное хранится в холодном кошельке, доступ в который осуществляется
        только в случае необходимости. Проще говоря, горячий кошелёк больше похож на текущий счёт, а холодный – на
        сберегательный счёт. Опытные пользователи хранят большую часть криптовалюты в безопасном холодном кошельке в
        режиме оффлайн и тратят их при помощи горячего кошелька. «Горячие» кошельки, как правило, работают по одному
        принципу, а вот «холодные» делятся на следующие группы: Программный кошелек - программа, которую устанавливают
        непосредственно на компьютер; Мобильный кошелек – дает возможность проведения транзакций при помощи телефона.
        Сам мобильный телефон поддерживает холодный вид хранения средств; Аппаратный кошелек – имеет маленький размер и
        встроенный дисплей. Устройство очень похоже на гибрид flash-накопителя и MP3-плеера; Бумажный кошелек –
        подразумевает хранение криптовалюты за счет распечатанных ключа и адреса на бумаге. Средства находятся за
        пределами Интернета, что защищает их от постороннего вмешательства. Может быть в виде QR-кода.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="WeakHands">
        <h2>Weak Hands</h2>{" "}
        (Дрожащие руки) – так называют тех, кто не может выдержать снижения
        курса стоимости криптовалюты на рынке и начинает её активно продавать. Это явление у
        владельцев криптовалюты, которые склонны к панике во время незначительного или
        стремительного падения курса стоимости крипты. По аналогии с дрожащими руками, держатели
        криптовалют часто нервничают и продают, как только появляются признаки снижения цены. Это не
        всегда приводит к потере прибыли, поскольку зачастую, закупаются по более низкой цене, что
        только больше подогревает страх того, что стоимость цифрового актива опять опустится на
        прежний уровень, что исключит возможность получить заветную разницу. Для дрожащих рук нет
        множества признаков, которые присущи другим терминам, есть только один – если курс падает
        хоть немного, значит нужно продавать.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Whale">
        <h2>Whale</h2>{" "}
        (Кит) – это легендарные участники рынка криптовалюты, на вмешательства
        которых, принято списывать все необъяснимые ситуации на биржах. Китов очень мало, но каждый
        из них настолько богат, и владеет таким количеством криптовалюты, что способен практически в
        одиночку развернуть рынок криптовалюты в нужном ему направлении. Это крупный криптотрейдер
        или же группа трейдеров, которые способны повлиять на рыночную ситуацию. Поэтому, когда цена
        начинает резко падать или расти без объяснимых причин, чаще всего говорят, что рынком
        манипулируют киты.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Wolf">
        <h2>Wolf</h2>{" "}
        (Волк) – опытные и расчётливые трейдеры. Большинство их сделок приносит
        прибыль. Волки прекрасно знают всех обитателей криптовалютного рынка, поскольку находятся на
        нём очень давно. Они часто пользуются слабостями других для личной выгоды. Волк на бирже –
        это игрок с большим опытом, багажом знаний и уверенностью в себе, сделки которого почти
        никогда не бывают провальными. Данный вид трейдеров почти что всегда уверены в правильности
        своих решений, и даже когда это не так, они просто «пересиживают» убытки и всё равно продают
        крипту по выгодной цене.
      </StyledDictionaryItem>
    </div>
  );
};

export default CryptoDictionaryItemW;