import React from "react";

import CryptoDictionaryHead from "./crypto-dictionary-head";
import { StyledDictionaryItem } from "../styled-crypto-dictionary";

const CryptoDictionaryItemL = () => {
  return (
    <div id="L">
      <CryptoDictionaryHead current="L" />
      <StyledDictionaryItem id="Lambo">
        <h2>Lambo</h2>{" "}
        (Ламбо) – данным высказыванием, которое стало почвой для множества мэмов и
        юмора на эту тему, подразумевают мгновенное и резкое обогащение, связанное с резким скачком
        курса криптовалюты. При этом, общая сумма разницы от стоимости покупки активов и стоимости
        их продажи настолько велика, что можно купить автомобиль «Lamborghini». Если люди упоминают
        фразу «Когда Lambo?», они подразумевают вопрос – «Когда они заработают достаточно денег,
        чтобы купить Lamborghini?». Многие криптовалютные миллионеры начали покупать «Lamborghini».
        Об увеличении продаж сообщил производитель спорткаров. Пик продаж пришелся на декабрь 2017
        года, когда цена Bitcoin достигла своего первого в истории рекордного уровня, и составила
        почти 20 тысяч долларов за одну монету. Автомобиль «Lamborghini» – это показатель статуса у
        криптотрейдеров. Поэтому считается, что в случае «туземуна», можно купить «ламбо». Фраза и
        юмор на эту тему стали настолько популярными, что даже выпустили криптовалюту с аналогичным
        названием «Lambo». При этом авторы даже не занимались продвижением – популярность тематики
        сделала своё дело. Однако данный проект сочли спекулятивным. Производители одноимённых
        автомобилей также решили не оставаться в стороне и стали продавать свои авто за
        криптовалюту. К примеру: 35-летний программист Питер Саддингтон приобрел «Lamborghini
        Huracan» 2015 года, стоимостью 200 000 долларов, всего за 115 долларов, которые когда-то
        инвестировал в Bitcoin. Появление данного понятия связано с тем, что нередко держатели
        криптовалют богатеют очень быстро. Задавая подобный вопрос, имеют ввиду, удалось ли
        действительно хорошо заработать на криптовалютах.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Long">
        <h2>Long</h2>{" "}
        (Длинный) – позиция, которая открывается, если трейдер предполагает, что на
        рынке будет движение вверх. Обычно длинные позиции открываются трейдером, если он верит в
        проект или криптовалюту и считает, что она значительно вырастет в цене через продолжительное
        время. Лонговать, – это значит играть на повышение, сначала идёт покупка и получение прибыли
        в том случае, когда цена вырастет и после следует продажа.
      </StyledDictionaryItem>
    </div>
  );
};

export default CryptoDictionaryItemL;