import React from "react";

import CryptoDictionaryHead from "./crypto-dictionary-head";
import { StyledDictionaryItem } from "../styled-crypto-dictionary";

const CryptoDictionaryItemM = () => {
  return (
    <div id="M">
      <CryptoDictionaryHead current="M" />
      <StyledDictionaryItem id="MarginTrading">
        <h2>Margin Trading</h2>{" "}
        (Маржинальный трейдинг) – торговля с использованием средств, предоставляемых трейдеру в кредит под залог
        оговоренной суммы — маржи. Такая торговля криптоактивами значительно увеличивает депозит трейдера, его доход, а
        также риски потерять все и очень быстро. По сравнению с обычными торговыми аккаунтами, маржинальные
        предоставляют трейдерам доступ к большему количеству средств, что позволяет им использовать это в своих
        позициях. при торговле криптовалютой средства зачастую предоставляются от других трейдеров, которые зарабатывают
        проценты на основе рыночного спроса на маржинальные фонды. Хотя эта функция и пользуется небольшим спросом,
        некоторые криптовалютные биржи предоставляют кредитные средства для своих пользователей. Маржинальная торговля
        криптовалютой, означает покупку цифровых активов с большей суммой монет или токенов, которые у вас есть в
        наличии. Это возможно благодаря рынку кредитования, известному как «плечо», который также работает и для
        криптовалют.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="MarketCap">
        <h2>Market Cap</h2>{" "}
        (Рыночная капитализация) – на криптовалютном рынке данный показатель
        иллюстрирует доминирование монет. Рыночная капитализация определяется произведением общего
        количества выпущенных монет на рыночную стоимость одной монеты. Капитализация всего рынка
        криптовалют уже составляет несколько десятком миллиардов долларов, и может составить вполне
        солидную конкуренцию капитализации ведущим мировым топовым компаниям. Рыночная капитализация
        криптовалют – это кумулятивная стоимость всех виртуальных монет, которые доступны
        пользователям. Капитализацию цифровой валюты можно посчитать, если умножить количество
        выпущенных монет на курс. Таким образом, капитализация зависит от цены и количества монет.
        Капитализация криптовалют – один из ключевых показателей для инвесторов. Чем она выше, тем
        меньше виртуальная валюта подвержена волатильности. Поэтому чтобы повлиять на стоимость BTC
        или Ethereum, необходимо будет подписать ряд сделок на многомиллиардные суммы.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="MaximumSupply">
        <h2>Maximum Supply</h2>{" "}
        (Максимальное предложение) – это максимальное количество монет,
        которое когда-либо будет существовать у криптовалюты. Иными словами, это максимальная
        эмиссия валюты. Когда количество монет достигнет максимума (Maximum Supply), то у
        криптовалюты больше не будет выпущено ни одной монеты, так как они уже достигнут
        максимального предложения, то есть в обороте будут все монеты. В качестве примера можно
        рассмотреть самую первую криптовалюту Bitcoin. Эмиссия биткоина составляет 21 миллион
        монет. Предполагается, что около 2140 года BTC достигнет своего максимального предложения.
        Биткойн контролирует предложение, и вознаграждение за блок уменьшается каждые 4 года. Ожидается,
        что к 2032 году будет добыто 99% Биткойнов. И только на добычу последнего 1% потребуется 100
        лет. Следует понимать, что майнеры не будут майнить монету, если вознаграждение за
        майнинг будет ниже, чем стоимость добычи монет. Соответственно, Bitcoin никогда не достигнет
        своего максимального предложения.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Mining">
        <h2>Mining</h2>{" "}
        (Майнинг) – термин «Майнинг», обычно ассоциируется с биткоином, одной из наиболее популярных криптовалют. Данное
        понятие относится ко всем разновидностям цифровой валюты, т. к. буквально означает «добыча» (от англ. Mining –
        добыча полезных ископаемых). Простая с виду операция – запуск вычислительной программы – способна принести
        хорошую прибыль без вложений ручного труда. В традиционных
        финансовых системах новые денежные знаки просто печатаются правительствами стран, когда им это нужно. Но
        цифровые валюты появляются
        иначе. Они генерируются компьютерами, а этот процесс называется майнинг. Это генерация новых монет, которая
        осуществляется в процессе выполнения математических расчетов хеш-функций для осуществления транзакций узлами
        криптовалютной сети. Поскольку единого центра нет, для обеспечения быстроты выполнения транзакций и стабильной
        работы пиринговой сети нужны большие вычислительные мощности. Майнингом называют поиск блоков с помощью
        сложных вычислений. Блоки похожи на математические головоломки. Видеокарты или Асики должны делать
        тысячи или даже миллионы операций в секунду, чтобы найти правильные ответы для решения блока. Работа майнеров
        состоит в том, чтобы по цепочке подобрать единственный хэш из огромного количества комбинаций. Этот хэш
        подходит к секретному ключу и новым транзакциям. Таким образом, майнер может получить награду в биткоинах за
        проделанную работу. Большое количество майнеров участвует в разгадывании хэша. После того, как хэш угадан, все
        транзакции закрываются и майнеры начинают разрабатывать новый блок. Математическая модель выглядит следующим
        образом. Майнеры ищут хэш, состоящий из хеша предыдущего блока, случайного числа и общей суммы хэшей за
        несколько последних минут. Майнеры меняют случайное число с одной единственной целью - оно должно
        соответствовать всем условиям системы.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="MiningFarm">
        <h2>Mining Farm</h2>{" "}
        (Майнинговая ферма) – майнинговые фермы часто ещё называют «Криптоферма» – это целая система вычислительного
        оборудования, которая занимается добычей криптовалюты путем нахождения блоков. Простыми словами, майнинг фермы
        представляют собой помещения с большим количество компьютеров и серверов, которые занимаются решением задач для
        майнинга. При появлении криптовалют сложность вычислений была невелика, блоки находились достаточно быстро, да и
        людей, занимающихся майнингом было немного. Все эти факторы позволяли добывать криптовалюту любому, используя
        лишь обычный домашний компьютер. Пока известно всего 4 типа криптоферм: CPU-фермы - данный вид ферм был
        популярен в период становления сферы криптовалют. В тот момент для добычи блока, мощности обычного процессора
        было достаточно для вычислений. Сейчас этот вид майнинга практически в прошлом. Практически не осталось тех, кто
        продолжает добывать крипту, причем лишь некоторые ее виды, именно таким типом; GPU-фермы – на данном типе ферм
        для вычислений используют видеокарты. Как оказалось, для добычи криптовалют, некоторые модели видеокарт,
        превосходят процессоры по скорости более чем в 100 раз. В своё время, это привело к резкому росту числа
        GPU-ферм. Преимуществом является и то, что видеокарты позволяют майнить множество видов криптовалют, а не одну
        конкретную монету; FPGA-фермы – эта технология предшествовала появлению <a href="#ASIC">ASIC</a>- майнинга и
        уступала последнему в таких показателях, как энергопотребление и эффективность. Это матрица вентиляторов,
        программирование которой осуществляется пользователем. У таких матриц была огромная проблема - высокая
        теплоотдача. Именно поэтому особого распространения они не получили; <a href="#ASIC">ASIC</a>-фермы –
        появление<a href="#ASIC">ASIC</a>-ферм, серьезно изменило всю индустрию майнинга, так как они выполняли свою
        задачу на порядок лучше, чем предыдущие устройства. Однако, их существенным недостатком является то, что они
        настроены только на добычу определенной крипты.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Moose">
        <h2>Moose</h2>{" "}
        (Лось) – происходит данное определение от созвучного английского слова «Loss», что означает – потеря. Те игроки,
        что с особой периодичностью не получают профита, а несут одни лишь убытки, регулярно «ловят лося». Ещё
        трейдеров, которые регулярно ловят лося, называют оленями.
      </StyledDictionaryItem>
    </div>
  );
};

export default CryptoDictionaryItemM;