import React from "react";
import CryptoDictionaryHead from "./crypto-dictionary-head";

import { StyledDictionaryItem } from "../styled-crypto-dictionary";

const CryptoDictionaryItemA = () => {
  return (
    <div id="A">
      <CryptoDictionaryHead current="A" />
      <StyledDictionaryItem id="AirDrop">
        <h2>AirDrop</h2>{" "}
        (Эйрдроп) – дословно данный термин означает – «высадка десанта» или «сброс груза». Имеется ввиду
        бесплатное распределение токенов среди криптовалютного сообщества. Иногда такие мероприятия
        проводят после форков или в самом начале проекта, чтобы прорекламировать его и привлечь
        внимание. Это позволяет сделать токен популярным в короткие сроки и привлечь больший капитал
        инвесторов. За получение бесплатных токенов, необходимо выполнить определённый ряд простых
        условий. AirDrop позволяет получить прибыль за минимальное количество действий. Полученные
        токены можно продать сразу после их выхода на биржу и обменять на криптовалюту. Зачастую к
        этому способу прибегают до запуска <a href="#ICO">ICO</a>-кампании для популяризации новой площадки, платформы,
        приложения, программы или криптовалюты, которой еще нет на биржах. Эйрдроп криптовалют
        относят к разновидности «вирусного маркетинга». Считать, что «эйрдроп» это «баунти» все-таки
        нельзя. Чтобы произошло перечисление электронных монет, нужно выполнить ряд условий
        связанных с популяризацией проекта, в отличии от <a href="#Bounty">«Bounty» (баунти)</a>,
        где предусмотрена раздача токенов в качестве подарка. AirDrop больше подразумевает фиксированное число
        вознаграждения для всех
        тех, кто выполнит определённые условие распространения информации о проекте, а иногда и раздачу токенов
        непосредственно инвесторам или участникам.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Altcoin">
        <h2>Altcoin</h2>{" "}
        (Альткоин) – общепринятое название для всех видов криптовалют за исключением Bitcoin. Термин
        является аббревиатурой от «Alternative Coin», что переводится как альтернативная от биткоина
        монета. На сегодняшний день в обороте находится более 2200 альткоинов, и их число не
        перестаёт расти. Первой в мире криптовалютой был Bitcoin, который был создан в 2009 году.
        Данную криптовалюту разработали с целью создать независимую и неподконтрольную ни одному
        государству или финансовой структуре, цифровую валюту, которой можно было бы расплачиваться
        в интернете. Позже, эту идею позаимствовали другие разработчики, и начали придумывать другие
        монеты, которые бы имели схожий функционал. Первой среди них стал Namecoin, который был
        создан в 2011 году. Альтернативные цифровые деньги могут появляться различными способами.
        Но, самый популярный вариант – это форк биткоина. Код биткоина открытый, его просто
        копируют, вносят минимальные коррективы, запускают рекламную кампанию и капитализируют новый
        проект. Другими известными способами появления альткоинов, являются хардфорки.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Arbitrage">
        <h2>Arbitrage</h2>{" "}
        (Арбитраж) – это процесс покупки дешевле криптовалюты на одной бирже и ее последующей
        продажи на другой. Комиссионные сборы и цены монет могут меняться в любое время при переводе
        монет с платформы на платформу, особенно во время сильной волатильности. Ещё одним фактором
        выступают задержки, связанные с депозитом и выводом монет на площадки. Разница между
        курсовой стоимостью монет и является прибылью. По сути, арбитраж – это последовательность
        операций по покупке и продаже валюты на разных площадках (пространственный арбитраж) или на
        протяжении определенного периода времени (временной арбитраж). Прибыль арбитражника
        рассчитывается, как разница в цене покупки и продажи актива. Такая стратегия применима и к
        рынку криптовалют. Но здесь арбитражем считается именно заработок от покупки и продажи
        актива на разных площадках (криптовалютных биржах). А под определение временного арбитража
        вполне подходит классический трейдинг, при котором актив покупается по низкой цене, а потом
        продается по высокой.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="ASIC">
        <h2>ASIC</h2>{" "}
        (Асик) – является аббревиатурой английского термина «Application Specific Integrated Circuit», что в переводе
        означает «интегральная схема специального назначения». Понятие относится к сфере майнинга и определяет один из
        его видов. В отличии от обычных интегральных схем для общего назначения, специализированные – применяются в
        конкретном устройстве и выполняют строго ограниченные функции, которые характерные только для данного
        устройства. Таким образом достигается ускорение и повышение результативности вычислительных процессов по
        сравнению с многозадачными устройствами. Это позволяет выполнять функций быстрее и, в конечном счёте, дешевле.
        Майнинг на ASIC ничем не отличается от обычного – это все то же выполнение огромного количества сложных
        математических вычислений с целью получения награды за нахождение нового блока. Однако, преимущество заключается
        в том, что этот тип добычи блоков позволяет направлять вычислительную мощность устройства на конкретные задачи,
        тем самым, не растрачивать их на нецелевые процессы. Кроме прироста хешрейта и других плюсов специализированного
        оборудования, по мере развития ASIC-майнинга выявились проблемы. Началась «гонка вооружений». Создатели
        блокчейн-протоколов ищут способы противостоять ASIC-майнингу, а производители майнингового оборудования –
        возможность обойти хитрости разработчиков. Асик представляет собой микрочип, сосредоточенный на выполнении задач
        одного конкретного вида. Первые Bitcoin-асики были выпущены в 2012 году — к тому моменту в традиционном майнинге
        уже вырисовалась проблема падения прибыльности из-за увеличения сложности добычи и чрезмерного
        энергопотребления.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="ATH">
        <h2>ATH</h2>{" "}
        - "All Time High" (Максимум за всё время) – самая высокая цена какой-либо криптовалюты или
        токена, которая побила все свои предыдущие рекорды, и находится на самом высоком уровне за
        всю историю своего существования. Иными словами, это самое большое биржевое значение курса
        активов за все время его существования с момента появления на рынке. На рынке к такому
        явлению относятся либо эмоционально, стараясь, как можно быстрее инвестировать в растущую
        криптовалюту, так и весьма аккуратно, осознавая, что необходимо провести фундаментальный
        анализ, чтобы определить, когда цена актива достигнет сопротивления и курс начнет падать.
        Исторический максимум сам по себе не следует использовать для разработки торговой стратегии,
        но он может и должен быть одним из нескольких инструментов, которые следует принимать во
        внимание.
      </StyledDictionaryItem>
    </div>
  );
};

export default CryptoDictionaryItemA;