import React from "react";

import CryptoDictionaryHead from "./crypto-dictionary-head";
import { StyledDictionaryItem } from "../styled-crypto-dictionary";

const CryptoDictionaryItemS = () => {
  return (
    <div id="S">
      <CryptoDictionaryHead current="S" />
      <StyledDictionaryItem id="Scam">
        <h2>Scam</h2>{" "}
        (Скам) – название проектов, которые закрылись по различным причинам. Чаще
        всего, данный термин несет негативный оттенок и относится к мошенникам, которые провели <a
        href="#ICO"
      >ICO</a> под заведомо ложным предлогом. Скам в криптовалюте, это проект,
        созданный для привлечения
        инвестиций и прекративший выполнение обязательств перед его участниками. Слово «Scam» имеет
        английское происхождение и переводится как «мошенничество». Термин «Scam» часто применяется
        по отношению к хайп-проектам – это специальные проекты, которые обещают высокие проценты
        инвесторам, но, по сути, являются финансовыми пирамидами. Именно из-за таких явлений, сферу
        криптовалюты часто отожествляют с финансовыми пирамидами, считая, что целая индустрия, по
        сути, и есть пирамидой. Но в Scam-проектах выплаты старым участникам происходят за счет
        новых инвесторов. В определенный момент создатели исчезают, а вместе с ними пропадают и
        деньги доверчивых пользователей и инвесторов. Если проект перестает выполнять обязательства
        перед участниками, он автоматически считается «скамом». Похожий вид мошенничества актуален и
        для <a href="#ICO">ICO</a>-проектов, собирающих деньги с пользователей на первичное
        размещение монет на бирже.
        Разработчики площадки анонсируют криптовалюту и предлагают инвесторам вложиться в нее, а в
        будущем получить стремительный и ошеломительный доход, а также ряд привилегий. При этом
        многие проекты так и не реализовываются, что автоматически присваивает им статус «Scam».
        Рассматривая, что такое скам в криптовалюте, можно ответить однозначно – это мошенничество,
        обман пользователей.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Sheep">
        <h2>Sheep</h2>{" "}
        (Овца) – овцы, это очень робкие и нерешительные трейдеры. На рынке
        криптовалют, они очень долго решаются на приобретение цифрового актива, а затем не менее
        долго колеблются, чтобы его продать по выгодному курсу в обеих случаях. Они постоянно не
        уверены в рынке и его сигналах, бездумно следуют за толпой, по аналогии с животным, в честь
        которого и называются, а затем становясь то быком, то медведем, но называются овцами. Когда
        на рынке сильные колебания, овцы теряют свои вложения. Этот тип людей просто слушает других
        для финансовых консультаций и часто пропускает наиболее значимые шаги на рынке. Их же могут
        называть лемминги за аналогию с групповыми действиями этих животных. Лемминги также
        встречаются в названии эмоциональных игроков, которые идут на поводу у своих страхов или
        эйфории.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Shill">
        <h2>Shill</h2>{" "}
        (Зазывала) – термин обозначает преувеличенное публичное одобрение какой-либо
        монеты. Участники рынка, купившие новые токены, заинтересованы в «шиллинге» - искусственном
        ажиотаже вокруг новой монеты. Другими словами, навязчиво создают иллюзию популярности,
        преувеличивая репутацию компании или подают другую информацию, искусственно продвигают
        проект. Зазывала (shill) выступает в роли клиента. Зачастую это целая команда, целью которой
        является привлечение клиентов через рекламирование в социальных сетях и прочих каналах
        распространения информации, заведомо мошеннических токенов или криптовалют.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Shitcoin">
        <h2>Shitcoin</h2>{" "}
        (Щиткоин) – дословное значение этого слова обозначает настолько плохую и
        дешевую криптовалюту, что её сравнивают с навозом. От английского слова shit – дерьмо, они
        же лоукап (low capitalization – низкая капитализация). Криптовалюты, не представляющие
        ценности. Так называют монеты, которые предлагают мошенники. Также, такое название носят
        абсолютно не востребованные и не интересные монеты для трейдеров. Уничижительный термин,
        используемый для описания какого-то посредственного альткоина, который стал бесполезным.
        Ценность Shitcoin может исчезнуть, так как интерес к нему не был реализован или в силу
        всеобщего разочарования, или в силу некомпетентности команды проекта или из-за банального
        скама проекта.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Short">
        <h2>Short</h2>{" "}
        (Короткий) – позиция, которая открывается, если трейдер предполагает, что на
        рынке будет падение. Шорт ордер предполагает, что трейдер занимает у биржи токены, продает
        их, а когда график достигает низкой точки – покупает эту валюту и возвращает ее бирже.
        Разницу между ценой продажи, которая выше, и ценой приобретения, которая ниже, трейдер
        оставляет себе – это его прибыль. Шортить – значит держать короткую позицию потому, как
        сначала идёт продажа, а потом откупают по низкой цене при этом получая прибыль.
      </StyledDictionaryItem>
      <StyledDictionaryItem id="Smart-contracts">
        <h2>Smart-contracts</h2>{" "}
        (Смарт-контракты) – смарт-контракт – электронный протокол, написанный с помощью компьютерного кода. Его
        назначение – передача информации и обеспечение исполнения условий контракта обеими сторонами. Одной из ключевых
        особенностей Smart-контрактов, является возможность безопасно обмениваться деньгами, акциями, собственностью и
        другими активами напрямую, без участия посредников. В упрощенной форме, это чем-то похоже на покупки в интернете
        с использованием транзитных счетов, когда отправитель товара не получит деньги, пока Вы его не заберёте и не
        подтвердите получение, и наоборот – если Вы его не заберёте, то с этих средств будут взысканы штраф и стоимость
        доставки. Смарт-контракты действуют похожим образом, но с большим количеством условий. Это программа, которая
        следит за выполнением обязательств обеих сторон, прописанных в контракте, а также автоматически взымает штрафы
        за нарушение или невыполнение условий сделки. Умные контракты обеспечивают безопасность сделки и лишены риска
        неоднозначной трактовки условий благодаря тому, что основаны на криптографии. Для смарт-контрактов в качестве
        оплаты транзакций используют криптовалюту Ethereum (Эфириум). Это не просто криптовалюта, это платформа
        позволяющая создавать на ней другие блокчейн приложения. Платформа Эфириума использует валюту под названием Эфир
        (ETH), которая служит средством оплаты транзакций. Блокчейн Эфириума работает также, как и блокчейн Биткоина –
        сеть компьютеров запускает специальное программное обеспечение, которое позволяет проверять транзакции в её
        сети. Однако Эфир здесь больше выступает в качестве привода, нежели обычной криптовалюты. Эфир необходим, чтобы
        запускать смарт контракты и приложения в блокчейне Эфириума.
      </StyledDictionaryItem>
    </div>
  );
};

export default CryptoDictionaryItemS;